MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_cortex.c
  - To enable or disable an MPU region, use HAL_CORTEX_MPU_EnableRegion() or HAL_CORTEX_MPU_DisableRegion().

  - To enable or disable the MPU, use HAL_CORTEX_MPU_Enable() or HAL_CORTEX_MPU_Disable().

  - To check if the MPU is enabled or not, use HAL_CORTEX_MPU_IsEnabled().

  - To check if the given MPU region is enabled or not, use HAL_CORTEX_MPU_IsEnabledRegion().

4. How to configure SCB using the CORTEX HAL driver:

  - When you need to get the CPU ID information within the application, use HAL_CORTEX_SCB_GetInfo().

  - Some exceptions can be redirected to their own IRQ channels or to the HARDFAULT IRQ channel. These exceptions are:
     - USAGE FAULT
     - BUS FAULT
     - MEMORY MANAGEMENT FAULT

  - When you need to redirect any exception to a HardFault, use HAL_CORTEX_SCB_EnableHardFaultEscalation().

  - When you need to disable any HardFault redirection, use HAL_CORTEX_SCB_DisableHardFaultEscalation().
  */
/**
  * @}
  */

/** @defgroup CORTEX_Configuration_Table CORTEX Configuration Table
  * @{
## Configuration inside the CORTEX driver

Config defines                    | Description      | Default value | Note
--------------------------------- | ---------------- | ------------- | ------------------------------------------
PRODUCT                           | from IDE         |     NA        | The selected product.
USE_ASSERT_DBG_PARAM              | from IDE         |     None      | Allows to use the assert check parameters.
USE_HAL_CHECK_PARAM               | from hal_conf.h  |     0         | Allows to use the run-time checks parameters.
USE_HAL_CORTEX_MODULE             | from hal_conf.h  |     1         | Allows to use HAL CORTEX module.
  */
/**
  * @}
  */

/* Private types -----------------------------------------------------------------------------------------------------*/
/* Private variables -------------------------------------------------------------------------------------------------*/
/* Private constants -------------------------------------------------------------------------------------------------*/
/** @defgroup CORTEX_Private_Constants CORTEX Private Constants
  * @{
  */
#define CORTEX_DEVICE_MASK      (0x0000000CU) /*!< Device memory mask          */
#define CORTEX_NORMAL_MASK      (0x000000F0U) /*!< Normal memory mask          */
#define CORTEX_ATTR_OUTER_MASK  (0x000000F0U) /*!< Outer attribute mask        */
#define CORTEX_ATTR_INNER_MASK  (0x0000000FU) /*!< Inner attribute mask        */
#define CORTEX_ATTR_REG_NUM     (0x00000004U) /*!< Attribute register number   */
#define CORTEX_ATTR_BITS_NUM    (0x00000008U) /*!< Attribute bits number       */
#define CORTEX_REGION_ADDR_MASK (0xFFFFFFE0U) /*!< Base and limit address mask */
/**
  * @}
  */

/* Private macros ----------------------------------------------------------------------------------------------------*/
/** @defgroup CORTEX_Private_Macros CORTEX Private Macros
  * @{
  */
/*! Macro to identify irq number (maximum value depends on the irq numbers on the device) */
#if defined(ADC3)
#define IS_IRQ_NUMBER(irq_number) ((irq_number) <= ADC3_IRQn)
#elif defined(COMP2)
#define IS_IRQ_NUMBER(irq_number) ((irq_number) <= COMP2_IRQn)
#else
#define IS_IRQ_NUMBER(irq_number) ((irq_number) <= LPDMA2_CH3_IRQn)
#endif /* PLAY1 */

/*! Macro to identify priority grouping */
#define IS_PRIORITY_GROUP(prio_grp) (((prio_grp) == HAL_CORTEX_NVIC_PRIORITY_GROUP_0)    \
                                     || ((prio_grp) == HAL_CORTEX_NVIC_PRIORITY_GROUP_1) \
                                     || ((prio_grp) == HAL_CORTEX_NVIC_PRIORITY_GROUP_2) \
                                     || ((prio_grp) == HAL_CORTEX_NVIC_PRIORITY_GROUP_3) \
                                     || ((prio_grp) == HAL_CORTEX_NVIC_PRIORITY_GROUP_4))

/*! Macro to identify preemption priority according the given priority group */
#define IS_PREEMP_PRIORITY(prio_grp, preemp_prio) (                                 \
    (((prio_grp)) == (HAL_CORTEX_NVIC_PRIORITY_GROUP_0)) ? (((preemp_prio)) == 0U): \
    (((prio_grp)) == (HAL_CORTEX_NVIC_PRIORITY_GROUP_1)) ? (((preemp_prio)) <= 1U): \
    (((prio_grp)) == (HAL_CORTEX_NVIC_PRIORITY_GROUP_2)) ? (((preemp_prio)) <= 3U): \
    (((prio_grp)) == (HAL_CORTEX_NVIC_PRIORITY_GROUP_3)) ? (((preemp_prio)) <= 7U): \
    (((preemp_prio) <= 15U)))

/*! Macro to identify sub-priority according the given priority group */
#define IS_SUB_PRIORITY(prio_grp, sub_prio) (                                      \
    (((prio_grp)) == (HAL_CORTEX_NVIC_PRIORITY_GROUP_0)) ? (((sub_prio) <= 15U)) : \
    (((prio_grp)) == (HAL_CORTEX_NVIC_PRIORITY_GROUP_1)) ? (((sub_prio) <= 7U))  : \
    (((prio_grp)) == (HAL_CORTEX_NVIC_PRIORITY_GROUP_2)) ? (((sub_prio) <= 3U))  : \
    (((prio_grp)) == (HAL_CORTEX_NVIC_PRIORITY_GROUP_3)) ? (((sub_prio) <= 1U))  : \
    (((sub_prio) == 0U)))

/*! Macro to identify the clock source */
#define IS_CLOCK_SOURCE(clk_src) (((clk_src) == HAL_CORTEX_SYSTICK_CLKSOURCE_EXTERNAL) \
                                  || ((clk_src) == HAL_CORTEX_SYSTICK_CLKSOURCE_INTERNAL))

/*! Macro to identify the HardFault NMI state */
#define IS_NMI_STATE(fault_nmi) (((fault_nmi) == HAL_CORTEX_MPU_HARDFAULT_NMI_DISABLE)  \
                                 || ((fault_nmi) == HAL_CORTEX_MPU_HARDFAULT_NMI_ENABLE))

/*! Macro to identify the Access Privilege */
#define IS_ACCESS_PRIV(access_priv) (((access_priv) == HAL_CORTEX_MPU_ACCESS_FAULT_ALL)          \
                                     || ((access_priv) == HAL_CORTEX_MPU_ACCESS_FAULT_ONLY_PRIV))

/*! Macro to identify device memory attribute */
#define IS_DEVICE_MEM_ATTR(device_attr) (((device_attr) == HAL_CORTEX_MPU_DEVICE_MEM_NGNRNE)    \
                                         || ((device_attr) == HAL_CORTEX_MPU_DEVICE_MEM_NGNRE)  \
                                         || ((device_attr) == HAL_CORTEX_MPU_DEVICE_MEM_NGRE)   \
                                         || ((device_attr) == HAL_CORTEX_MPU_DEVICE_MEM_GRE))

/*! Macro to identify the memory attribute */
#define IS_NORMAL_MEM_ATTR(mem_attr) (((mem_attr) == HAL_CORTEX_MPU_NORMAL_MEM_NCACHEABLE)               \
                                      || ((mem_attr) == HAL_CORTEX_MPU_NORMAL_MEM_WT_NOA)                \
                                      || ((mem_attr) == HAL_CORTEX_MPU_NORMAL_MEM_WT_WA)                 \
                                      || ((mem_attr) == HAL_CORTEX_MPU_NORMAL_MEM_WT_RA)                 \
                                      || ((mem_attr) == HAL_CORTEX_MPU_NORMAL_MEM_WT_RWA)                \
                                      || ((mem_attr) == HAL_CORTEX_MPU_NORMAL_MEM_WB_NOA)                \
                                      || ((mem_attr) == HAL_CORTEX_MPU_NORMAL_MEM_WB_WA)                 \
                                      || ((mem_attr) == HAL_CORTEX_MPU_NORMAL_MEM_WB_RA)                 \
                                      || ((mem_attr) == HAL_CORTEX_MPU_NORMAL_MEM_WB_RWA))

/*! Macro to identify the memory attribute index */
#define IS_MEM_ATTR_IDX(mem_attr_idx) (((mem_attr_idx)   == HAL_CORTEX_MPU_MEM_ATTR_0)            \
                                       || ((mem_attr_idx) == HAL_CORTEX_MPU_MEM_ATTR_1)           \
                                       || ((mem_attr_idx) == HAL_CORTEX_MPU_MEM_ATTR_2)           \
                                       || ((mem_attr_idx) == HAL_CORTEX_MPU_MEM_ATTR_3)           \
                                       || ((mem_attr_idx) == HAL_CORTEX_MPU_MEM_ATTR_4)           \
                                       || ((mem_attr_idx) == HAL_CORTEX_MPU_MEM_ATTR_5)           \
                                       || ((mem_attr_idx) == HAL_CORTEX_MPU_MEM_ATTR_6)           \
                                       || ((mem_attr_idx) == HAL_CORTEX_MPU_MEM_ATTR_7))

/*! Macro to identify MPU region index */
#define IS_MPU_REGION(mpu_region) (((mpu_region) == HAL_CORTEX_MPU_REGION_0)    \
                                   || ((mpu_region) == HAL_CORTEX_MPU_REGION_1) \
                                   || ((mpu_region) == HAL_CORTEX_MPU_REGION_2) \
                                   || ((mpu_region) == HAL_CORTEX_MPU_REGION_3) \
                                   || ((mpu_region) == HAL_CORTEX_MPU_REGION_4) \
                                   || ((mpu_region) == HAL_CORTEX_MPU_REGION_5) \
                                   || ((mpu_region) == HAL_CORTEX_MPU_REGION_6) \
                                   || ((mpu_region) == HAL_CORTEX_MPU_REGION_7))

/*! Macro to identify fault exceptions */
#define IS_FAULT_EXCEPT(fault_except)                                              \
  ((((fault_except) & (HAL_CORTEX_SCB_USAGE_FAULT | HAL_CORTEX_SCB_BUS_FAULT  |    \
                       HAL_CORTEX_SCB_MEM_MANAGEMENT_FAULT)) != 0x00U)             \
   && (((fault_except) & ~(HAL_CORTEX_SCB_USAGE_FAULT | HAL_CORTEX_SCB_BUS_FAULT | \
                           HAL_CORTEX_SCB_MEM_MANAGEMENT_FAULT)) == 0x00U))

/*! Macro to identify region access attribute */
#define IS_ACCESS_ATTR(access_attr) (((access_attr) == HAL_CORTEX_MPU_REGION_ONLY_PRIV_RW)    \
                                     || ((access_attr) == HAL_CORTEX_MPU_REGION_ALL_RW)       \
                                     || ((access_attr) == HAL_CORTEX_MPU_REGION_ONLY_PRIV_RO) \
                                     || ((access_attr) == HAL_CORTEX_MPU_REGION_ALL_RO))

