MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_cortex.c
/*! Macro to identify the execution attribute */
#define IS_EXEC_ATTR(exec_attr)      (((exec_attr) == HAL_CORTEX_MPU_EXECUTION_ATTR_DISABLE) \
                                      || ((exec_attr) == HAL_CORTEX_MPU_EXECUTION_ATTR_ENABLE))

/**
  * @}
  */

/* Exported functions ------------------------------------------------------------------------------------------------*/
/** @addtogroup CORTEX_Exported_Functions
  * @{
  */

/** @addtogroup CORTEX_Exported_Functions_Group1
  * @{
- This subsection provides a set of functions to configure CORTEX NVIC block features.
  - Use HAL_CORTEX_NVIC_SetPriorityGrouping() to set the priority grouping.
  - Use HAL_CORTEX_NVIC_GetPriorityGrouping() to get the priority grouping.
  - Use HAL_CORTEX_NVIC_SetPriority() to set the interrupt preemption priority.
  - Use HAL_CORTEX_NVIC_GetPriority() to get the interrupt preemption priority.
  - Use HAL_CORTEX_NVIC_EnableIRQ() to enable an interrupt.
  - Use HAL_CORTEX_NVIC_DisableIRQ() to disable the interrupt.
  - Use HAL_CORTEX_NVIC_IsEnabledIRQ() to check whether an interrupt is enabled or not.
  - Use HAL_CORTEX_NVIC_IsActiveIRQ() to check whether an interrupt is active or not.
  - Use HAL_CORTEX_NVIC_SetPendingIRQ() to set an interrupt in pending state.
  - Use HAL_CORTEX_NVIC_ClearPendingIRQ() to clear a pending interrupt.
  - Use HAL_CORTEX_NVIC_IsPendingIRQ() to check whether an interrupt is pending or not.
  - Use HAL_CORTEX_NVIC_SystemReset() to perform a system reset.
  */

/**
  * @brief   Set the priority grouping field (preemption priority and subpriority)
  *          using the required unlock sequence.
  * @param   prio_grp: The priority grouping bits length.
  *          This parameter is an element of \ref hal_cortex_nvic_priority_group_t enumeration.
  * @note    When the HAL_CORTEX_NVIC_PRIORITY_GROUP_1 is selected, there is one bit for preemption priority and three
  *          bits for sub-priority.
  * @note    When the HAL_CORTEX_NVIC_PRIORITY_GROUP_2 is selected, there are two bits for preemption priority and two
  *          bits for sub-priority.
  * @note    When the HAL_CORTEX_NVIC_PRIORITY_GROUP_3 is selected, there are three bits for preemption priority and one
  *          bit for sub-priority.
  * @warning When the HAL_CORTEX_NVIC_PRIORITY_GROUP_0 is selected, IRQ preemption is no longer possible.
  *          The pending IRQ priority is managed only by the sub-priority.
  * @warning When the HAL_CORTEX_NVIC_PRIORITY_GROUP_4 is selected, IRQ sub-priority is no longer possible.
  *          The pending IRQ priority is managed only by the preemption.
  */
void HAL_CORTEX_NVIC_SetPriorityGrouping(hal_cortex_nvic_priority_group_t prio_grp)
{
  ASSERT_DBG_PARAM(IS_PRIORITY_GROUP(prio_grp));

  NVIC_SetPriorityGrouping((uint32_t)prio_grp);
}

/**
  * @brief  Get the priority grouping field from the NVIC Interrupt Controller.
  * @retval hal_cortex_nvic_priority_group_t Priority group value.
  */
hal_cortex_nvic_priority_group_t HAL_CORTEX_NVIC_GetPriorityGrouping(void)
{
  return ((hal_cortex_nvic_priority_group_t)NVIC_GetPriorityGrouping());
}

/**
  * @brief Set the priority of an interrupt.
  * @param irqn: The interrupt number.
  *        This parameter can be a value of IRQn_Type enumeration.
  *        (For the complete STM32 Devices IRQ Channels list, please refer to the appropriate
  *         CMSIS device file (stm32c5xxxx.h))
  * @param preemp_prio: Specify the preemption priority for the IRQn channel.
  *        This parameter is an element of \ref hal_cortex_nvic_preemp_priority_t enumeration.
  * @param sub_prio: Specify the subpriority level for the IRQ channel.
  *        This parameter is an element of \ref hal_cortex_nvic_sub_priority_t enumeration.
  */
void HAL_CORTEX_NVIC_SetPriority(IRQn_Type irqn, hal_cortex_nvic_preemp_priority_t preemp_prio,
                                 hal_cortex_nvic_sub_priority_t sub_prio)
{
  ASSERT_DBG_PARAM(IS_IRQ_NUMBER(irqn));
  ASSERT_DBG_PARAM(IS_PREEMP_PRIORITY(NVIC_GetPriorityGrouping(), preemp_prio));
  ASSERT_DBG_PARAM(IS_SUB_PRIORITY(NVIC_GetPriorityGrouping(), sub_prio));

  /* Set the preemption priority and sub-priority according to the priority grouping meaning
     the number of allocated bits used respectively to encode the preemption and sub-priority */
  NVIC_SetPriority(irqn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(), (uint32_t)preemp_prio, (uint32_t)sub_prio));
}

/**
  * @brief Get the priority of an interrupt.
  * @param irqn: The interrupt number.
  *         This parameter can be a value of IRQn_Type enumeration.
  *        (For the complete STM32 Devices IRQ Channels list, please refer to the appropriate
  *         CMSIS device file (stm32c5xxxx.h))
  * @param p_preemp_prio: Get the preemption priority for the IRQn channel.
  *        This parameter is an element of \ref hal_cortex_nvic_preemp_priority_t enumeration.
  * @param p_sub_prio: Get the subpriority level for the IRQ channel.
  *        This parameter is an element of \ref hal_cortex_nvic_sub_priority_t enumeration.
  */
void HAL_CORTEX_NVIC_GetPriority(IRQn_Type irqn, hal_cortex_nvic_preemp_priority_t *p_preemp_prio,
                                 hal_cortex_nvic_sub_priority_t *p_sub_prio)
{
  uint32_t preemp_prio = 0U;
  uint32_t sub_prio = 0U;

  ASSERT_DBG_PARAM(IS_IRQ_NUMBER(irqn));
  ASSERT_DBG_PARAM(p_preemp_prio != NULL);
  ASSERT_DBG_PARAM(p_sub_prio != NULL);
  /* Retrieve the preemption priority and sub-priority according to the priority grouping meaning the number
     of allocated bits used respectively to encode the preemption and sub-priority */
  NVIC_DecodePriority(NVIC_GetPriority(irqn), (uint32_t)NVIC_GetPriorityGrouping(), &preemp_prio, &sub_prio);

  *p_preemp_prio = (hal_cortex_nvic_preemp_priority_t)preemp_prio;
  *p_sub_prio    = (hal_cortex_nvic_sub_priority_t)sub_prio;
}

/**
  * @brief Enable the specified interrupt in the NVIC interrupt controller.
  * @param irqn External interrupt number.
  *        This parameter can be a value of IRQn_Type.
  *        (For the complete STM32 Devices IRQ Channels list, please refer to the appropriate
  *         CMSIS device file (stm32c5xxxx.h))
  */
void HAL_CORTEX_NVIC_EnableIRQ(IRQn_Type irqn)
{
  ASSERT_DBG_PARAM(IS_IRQ_NUMBER(irqn));

