MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_cortex.c
  NVIC_EnableIRQ(irqn);
}

/**
  * @brief Disable the specified interrupt in the NVIC interrupt controller.
  * @param irqn External interrupt number.
  *        This parameter can be a value of IRQn_Type.
  *        (For the complete STM32 Devices IRQ Channels list, please refer to the appropriate
  *         CMSIS device file (stm32c5xxxx.h))
  */
void HAL_CORTEX_NVIC_DisableIRQ(IRQn_Type irqn)
{
  ASSERT_DBG_PARAM(IS_IRQ_NUMBER(irqn));

  NVIC_DisableIRQ(irqn);
}

/**
  * @brief  Check whether the specified IRQn is enabled or disabled.
  * @param  irqn: Specify the interrupt number.
  *         This parameter can be a value of IRQn_Type enumeration.
  *         (For the complete STM32 Devices IRQ Channels list, please refer to the appropriate
  *          CMSIS device file (stm32c5xxxx.h))
  * @retval hal_cortex_nvic_irq_status_t Interrupt enable status value.
  */
hal_cortex_nvic_irq_status_t HAL_CORTEX_NVIC_IsEnabledIRQ(IRQn_Type irqn)
{
  ASSERT_DBG_PARAM(IS_IRQ_NUMBER(irqn));

  return ((hal_cortex_nvic_irq_status_t)NVIC_GetEnableIRQ(irqn));
}

/**
  * @brief  Check whether an interrupt is active.
  * @param  irqn: Specify the interrupt number.
  *         This parameter can be a value of IRQn_Type.
  *         (For the complete STM32 Devices IRQ Channels list, please refer to the appropriate
  *          CMSIS device file (stm32c5xxxx.h))
  * @note   Reads the active register in NVIC and returns the active bit.
  * @retval hal_cortex_nvic_irq_active_status_t Interrupt active status value.
  */
hal_cortex_nvic_irq_active_status_t HAL_CORTEX_NVIC_IsActiveIRQ(IRQn_Type irqn)
{
  ASSERT_DBG_PARAM(IS_IRQ_NUMBER(irqn));

  return ((hal_cortex_nvic_irq_active_status_t)NVIC_GetActive(irqn));
}

/**
  * @brief Set the pending bit of an external interrupt.
  * @param irqn External interrupt number.
  *        This parameter can be a value of IRQn_Type enumeration.
  *        (For the complete STM32 Devices IRQ Channels list, please refer to the appropriate
  *         CMSIS device file (stm32c5xxxx.h))
  */
void HAL_CORTEX_NVIC_SetPendingIRQ(IRQn_Type irqn)
{
  ASSERT_DBG_PARAM(IS_IRQ_NUMBER(irqn));

  NVIC_SetPendingIRQ(irqn);
}

/**
  * @brief Clear the pending bit of an external interrupt.
  * @param irqn External interrupt number.
  *        This parameter can be a value of IRQn_Type enumeration.
  *        (For the complete STM32 Devices IRQ Channels list, please refer to the appropriate
  *         CMSIS device file (stm32c5xxxx.h))
  */
void HAL_CORTEX_NVIC_ClearPendingIRQ(IRQn_Type irqn)
{
  ASSERT_DBG_PARAM(IS_IRQ_NUMBER(irqn));

  NVIC_ClearPendingIRQ(irqn);
}

/**
  * @brief  Check pending interrupt.
  * @param  irqn External interrupt number.
  *         This parameter can be a value of IRQn_Type enumeration.
  *         (For the complete STM32 Devices IRQ Channels list, please refer to the appropriate
  *          CMSIS device file (stm32c5xxxx.h))
  * @note   Reads the NVIC pending register and returns the pending bit for the specified interrupt.
  * @retval hal_cortex_nvic_irq_pending_status_t Interrupt pending status value.
  */
hal_cortex_nvic_irq_pending_status_t HAL_CORTEX_NVIC_IsPendingIRQ(IRQn_Type irqn)
{
  ASSERT_DBG_PARAM(IS_IRQ_NUMBER(irqn));

  return ((hal_cortex_nvic_irq_pending_status_t)NVIC_GetPendingIRQ(irqn));
}

/**
  * @brief  Initiate a system reset request to reset the MCU.
  */
__NO_RETURN void HAL_CORTEX_NVIC_SystemReset(void)
{
  NVIC_SystemReset();
}

/**
  * @}
  */

/** @addtogroup CORTEX_Exported_Functions_Group2
  * @{
- This subsection provides a set of functions to configure CORTEX SYSTICK block features.
  - Use HAL_CORTEX_SYSTICK_SetFreq() to configure SYSTICK block frequency.
  - Use HAL_CORTEX_SYSTICK_SetClkSource() to configure clock source.
  - Use HAL_CORTEX_SYSTICK_Suspend() to suspend the core ticks.
  - Use HAL_CORTEX_SYSTICK_Resume() to resume the core ticks.
  */

/**
  * @brief  Configure the SysTick frequency.
  * @param  ticks_freq: Specifies the frequency in Hz.
  * @retval HAL_OK              Function succeeded.
  * @retval HAL_ERROR           Function failed.
  * @retval HAL_INVALID_PARAM   Invalid parameter.
  */
hal_status_t HAL_CORTEX_SYSTICK_SetFreq(uint32_t ticks_freq)
{
  uint32_t ticks = 0U;

  /* Check the parameters */
  ASSERT_DBG_PARAM(ticks_freq > 0UL);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (ticks_freq == 0UL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  /* Get ticks frequency according to the SysTick source clock frequency */
  if (SysTick_GetClkSource() == SysTick_CTRL_CLKSOURCE_Msk)
  {
    /* The SysTick clock source is the CPU clock, get the CPU clock frequency */
    ticks = HAL_RCC_GetHCLKFreq();
  }
  else
  {
    /* The SysTick clock source is external (RCC). Get its frequency */
    ticks = HAL_RCC_GetSysTickExternalClkFreq();
  }

  ticks /= ticks_freq;

  /* Set the SysTick reload counter according to the ticks frequency and requested frequency */
  if (SysTick_SetReload(ticks) == 1U)
  {
    /* Reload value impossible */
    return HAL_ERROR;
  }

  /* Load the SysTick counter value */
  SysTick_SetCounter(0UL);

  SysTick_Enable();
  SysTick_EnableIT();

  return HAL_OK;
}

/**
  * @brief Configure the SysTick clock source.
  * @param clk_src: Specifies the SysTick clock source.
  *        This parameter is an element of \ref hal_cortex_systick_clk_src_t enumeration.
  */
void HAL_CORTEX_SYSTICK_SetClkSource(hal_cortex_systick_clk_src_t clk_src)
{
  /* Check the parameters */
  ASSERT_DBG_PARAM(IS_CLOCK_SOURCE(clk_src));

  /* Configure the SysTick CPU clock source */
  SysTick_SetClkSource((uint32_t)clk_src);
}

/**
  * @brief Suspend core ticks.
  */
void HAL_CORTEX_SYSTICK_Suspend(void)
{
  SysTick_DisableIT();
}

/**
  * @brief Resume core ticks.
  */
void HAL_CORTEX_SYSTICK_Resume(void)
{
  SysTick_EnableIT();
}

/**
  * @brief Handle SYSTICK interrupt request.
  */
void HAL_CORTEX_SYSTICK_IRQHandler(void)
{
  HAL_CORTEX_SYSTICK_Callback();
}

/**
  * @brief SYSTICK callback.
  */
__WEAK void HAL_CORTEX_SYSTICK_Callback(void)
{
  /* Warning: Do not modify this function. When the callback is needed,
             implement HAL_CORTEX_SYSTICK_Callback in the user file.
   */
}

/**
  * @}
  */

