MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_cortex.c
/** @addtogroup CORTEX_Exported_Functions_Group3
  *  @{
- This subsection provides a set of functions to configure the CORTEX MPU block features.
  - Use HAL_CORTEX_MPU_Enable() to enable the MPU.
  - Use HAL_CORTEX_MPU_Disable() to disable the MPU.
  - Use HAL_CORTEX_MPU_IsEnabled() to check whether the MPU is enabled or disabled.
  - Use HAL_CORTEX_MPU_GetDeviceMemAttr() to get device memory attributes.
  - Use HAL_CORTEX_MPU_SetDeviceMemAttr() to set device memory attributes.
  - Use HAL_CORTEX_MPU_GetCacheMemAttr() to get normal memory (cache) attributes.
  - Use HAL_CORTEX_MPU_SetCacheMemAttr() to set normal memory (cache) attributes.
  - Use HAL_CORTEX_MPU_SetConfigRegion() to set region configuration.
  - Use HAL_CORTEX_MPU_GetConfigRegion() to get region configuration.
  - Use HAL_CORTEX_MPU_EnableRegion() to enable a region configuration.
  - Use HAL_CORTEX_MPU_DisableRegion() to disable a region configuration.
  - Use HAL_CORTEX_MPU_IsEnabledRegion() to check whether a region memory enabled or not.
  */

/**
  * @brief Enable MPU and set the control mode of the MPU during HardFault,
  *        NMI, FAULTMASK, and privileged access to the default memory.
  * @param fault_state: Configure the control mode during HardFault, NMI, and FAULTMASK.
  *        This parameter is an element of \ref hal_cortex_mpu_hardfault_nmi_state_t enumeration.
  * @param priv_default_state: Configure the privileged access to the default memory.
  *        This parameter is an element of \ref hal_cortex_mpu_unmapped_addr_fault_t enumeration.
  */
void HAL_CORTEX_MPU_Enable(hal_cortex_mpu_hardfault_nmi_state_t fault_state,
                           hal_cortex_mpu_unmapped_addr_fault_t priv_default_state)
{
  ASSERT_DBG_PARAM(IS_NMI_STATE(fault_state));
  ASSERT_DBG_PARAM(IS_ACCESS_PRIV(priv_default_state));

  ARM_MPU_Enable(((uint32_t)fault_state) | ((uint32_t)priv_default_state));
}

/**
  * @brief  Disable MPU
  */
void HAL_CORTEX_MPU_Disable(void)
{
  ARM_MPU_Disable();
}

/**
  * @brief  Check whether the MPU is enabled.
  * @retval hal_cortex_mpu_status_t MPU status value.
  */
hal_cortex_mpu_status_t HAL_CORTEX_MPU_IsEnabled(void)
{
  return ((STM32_READ_BIT(MPU->CTRL, MPU_CTRL_ENABLE_Msk) == MPU_CTRL_ENABLE_Msk)
          ? HAL_CORTEX_MPU_ENABLED : HAL_CORTEX_MPU_DISABLED);
}

/**
  * @brief Set the device memory attributes configuration.
  * @param attr_idx: Specify the attributes index.
  *        This parameter is an element of \ref hal_cortex_mpu_mem_attr_idx_t enumeration.
  * @param mem_attr: Specify the device.
  *        This parameter is an element of \ref hal_cortex_mpu_device_mem_attr_t enumeration.
  */
void HAL_CORTEX_MPU_SetDeviceMemAttr(hal_cortex_mpu_mem_attr_idx_t attr_idx, hal_cortex_mpu_device_mem_attr_t mem_attr)
{
  ASSERT_DBG_PARAM(IS_MEM_ATTR_IDX(attr_idx));
  ASSERT_DBG_PARAM(IS_DEVICE_MEM_ATTR(mem_attr));

  ARM_MPU_SetMemAttr((uint8_t)attr_idx, (uint8_t)mem_attr);
}

/**
  * @brief  Get the device memory attributes configuration.
  * @param  attr_idx: Specify the attributes index.
  *         This parameter is an element of \ref hal_cortex_mpu_mem_attr_idx_t enumeration.
  * @retval hal_cortex_mpu_device_mem_attr_t Device memory attribute value.
  */
hal_cortex_mpu_device_mem_attr_t HAL_CORTEX_MPU_GetDeviceMemAttr(hal_cortex_mpu_mem_attr_idx_t attr_idx)
{
  hal_cortex_mpu_device_mem_attr_t mem_attr;
  uint8_t attr_reg_idx = 0U;
  uint8_t attr_bits_pos = 0U;
  uint8_t dev_attr = 0U;

  ASSERT_DBG_PARAM(IS_MEM_ATTR_IDX(attr_idx));

  attr_reg_idx  = (uint8_t)attr_idx / CORTEX_ATTR_REG_NUM;
  attr_bits_pos = (((uint8_t)attr_idx % CORTEX_ATTR_REG_NUM) * CORTEX_ATTR_BITS_NUM);
  dev_attr      = (uint8_t)(MPU->MAIR[attr_reg_idx] >> attr_bits_pos);

  if ((dev_attr & (~CORTEX_DEVICE_MASK)) == 0U)
  {
    mem_attr = (hal_cortex_mpu_device_mem_attr_t)(dev_attr);
  }
  else
  {
    mem_attr = HAL_CORTEX_MPU_DEVICE_MEM_INVALID;
  }

  return (mem_attr);
}

/**
  * @brief Set cache memory attributes configuration.
  * @param attr_idx: Specify the attributes index.
  *        This parameter is an element of \ref hal_cortex_mpu_mem_attr_idx_t enumeration.
  * @param mem_attr: Specify the cache memory config.
  *        This parameter is an element of \ref hal_cortex_mpu_normal_mem_cache_attr_t enumeration.
  */
void HAL_CORTEX_MPU_SetCacheMemAttr(hal_cortex_mpu_mem_attr_idx_t attr_idx,
                                    hal_cortex_mpu_normal_mem_cache_attr_t mem_attr)
{
  ASSERT_DBG_PARAM(IS_MEM_ATTR_IDX(attr_idx));
  ASSERT_DBG_PARAM(IS_NORMAL_MEM_ATTR(mem_attr));

  ARM_MPU_SetMemAttr((uint8_t)attr_idx, (CORTEX_ATTR_INNER_MASK | (uint8_t)mem_attr));
}

/**
  * @brief  Get the cache memory attributes configuration.
  * @param  attr_idx: Specify the attributes index.
  *         This parameter is an element of \ref hal_cortex_mpu_mem_attr_idx_t enumeration.
  * @retval hal_cortex_mpu_normal_mem_cache_attr_t Normal memory attribute value.
  */
hal_cortex_mpu_normal_mem_cache_attr_t HAL_CORTEX_MPU_GetCacheMemAttr(hal_cortex_mpu_mem_attr_idx_t attr_idx)
{
  hal_cortex_mpu_normal_mem_cache_attr_t mem_attr;
  uint8_t attr_reg_idx = 0U;
  uint8_t attr_bits_pos = 0U;
  uint8_t normal_mem_attr = 0U;

  ASSERT_DBG_PARAM(IS_MEM_ATTR_IDX(attr_idx));

  attr_reg_idx    = ((uint8_t)attr_idx / CORTEX_ATTR_REG_NUM);
  attr_bits_pos   = (((uint8_t)attr_idx % CORTEX_ATTR_REG_NUM) * CORTEX_ATTR_BITS_NUM);
  normal_mem_attr = (uint8_t)(MPU->MAIR[attr_reg_idx] >> attr_bits_pos);

  /* Check if the normal memory mode is enabled */
  if ((normal_mem_attr & CORTEX_NORMAL_MASK) != 0U)
  {
    mem_attr = (hal_cortex_mpu_normal_mem_cache_attr_t)(uint32_t)((uint32_t)normal_mem_attr & CORTEX_ATTR_OUTER_MASK);
  }
  else
  {
    mem_attr = HAL_CORTEX_MPU_NORMAL_MEM_INVALID;
  }

  return (mem_attr);
}

/**
  * @brief  Set the MPU region configuration.
  * @param  region_idx: Specify the region index.
  *         This parameter is an element of \ref hal_cortex_mpu_region_idx_t enumeration.
  * @param  p_config: Pointer to the \ref hal_cortex_mpu_region_config_t structure
  *                   that contains the configuration for the MPU region.
  * @retval HAL_OK            Function succeeded.
  * @retval HAL_INVALID_PARAM Function failed (HAL_INVALID_PARAM).
  */
hal_status_t HAL_CORTEX_MPU_SetConfigRegion(hal_cortex_mpu_region_idx_t region_idx,
                                            const hal_cortex_mpu_region_config_t *p_config)
{
  ASSERT_DBG_PARAM(IS_MPU_REGION(region_idx));

  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(IS_MEM_ATTR_IDX(p_config->attr_idx));
  ASSERT_DBG_PARAM(IS_ACCESS_ATTR(p_config->access_attr));
  ASSERT_DBG_PARAM(IS_EXEC_ATTR(p_config->exec_attr));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)

  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ARM_MPU_SetRegion((uint32_t)region_idx, (((uint32_t)p_config->base_addr & CORTEX_REGION_ADDR_MASK)
                                           | ((uint32_t)p_config->access_attr << MPU_RBAR_AP_Pos)
                                           | ((uint32_t)p_config->exec_attr   << MPU_RBAR_XN_Pos)),
                    (((uint32_t)p_config->limit_addr & CORTEX_REGION_ADDR_MASK)
                     | ((uint32_t)p_config->attr_idx << MPU_RLAR_AttrIndx_Pos)));

  return HAL_OK;
}

/**
  * @brief Get the MPU region configuration.
  * @param region_idx: Specify the region index.
  *        This parameter is an element of \ref hal_cortex_mpu_region_idx_t enumeration.
  * @param p_config: Pointer to the \ref hal_cortex_mpu_region_config_t structure
  *                  that contains the configuration for the MPU region.
  */
void HAL_CORTEX_MPU_GetConfigRegion(hal_cortex_mpu_region_idx_t region_idx,
                                    hal_cortex_mpu_region_config_t *p_config)
{
  ASSERT_DBG_PARAM(IS_MPU_REGION(region_idx));
  ASSERT_DBG_PARAM(p_config != NULL);

