MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_cortex.c
  STM32_WRITE_REG(MPU->RNR, (uint32_t)region_idx);
  p_config->base_addr   = _FLD2VAL(MPU_RBAR_BASE, MPU->RBAR) << MPU_RBAR_BASE_Pos;
  p_config->access_attr = (hal_cortex_mpu_region_access_attr_t)_FLD2VAL(MPU_RBAR_AP, MPU->RBAR);
  p_config->exec_attr   = (hal_cortex_mpu_execution_attr_t)(uint32_t)STM32_READ_BIT(MPU->RBAR, MPU_RBAR_XN_Msk);
  p_config->limit_addr  = (_FLD2VAL(MPU_RLAR_LIMIT, MPU->RLAR) << MPU_RLAR_LIMIT_Pos) + 0x1FUL;
  p_config->attr_idx    = (hal_cortex_mpu_mem_attr_idx_t) _FLD2VAL(MPU_RLAR_AttrIndx, MPU->RLAR);
}

/**
  * @brief Enable the given MPU region.
  * @param region_idx: Specify the region index.
  *        This parameter is an element of \ref hal_cortex_mpu_region_idx_t enumeration.
  */
void HAL_CORTEX_MPU_EnableRegion(hal_cortex_mpu_region_idx_t region_idx)
{
  ASSERT_DBG_PARAM(IS_MPU_REGION(region_idx));

  STM32_WRITE_REG(MPU->RNR, (uint32_t)region_idx);

  STM32_SET_BIT(MPU->RLAR, MPU_RLAR_EN_Msk);
}

/**
  * @brief Disable the given MPU region.
  * @param region_idx: Specify the region index.
  *        This parameter is an element of \ref hal_cortex_mpu_region_idx_t enumeration.
  */
void HAL_CORTEX_MPU_DisableRegion(hal_cortex_mpu_region_idx_t region_idx)
{
  ASSERT_DBG_PARAM(IS_MPU_REGION(region_idx));

  STM32_WRITE_REG(MPU->RNR, (uint32_t)region_idx);

  STM32_CLEAR_BIT(MPU->RLAR, MPU_RLAR_EN_Msk);
}

/**
  * @brief  Check whether the given MPU region is enabled.
  * @param  region_idx: Specify the region index.
  *         This parameter is an element of \ref hal_cortex_mpu_region_idx_t enumeration.
  * @retval hal_cortex_mpu_region_status_t MPU region status value.
  */
hal_cortex_mpu_region_status_t HAL_CORTEX_MPU_IsEnabledRegion(hal_cortex_mpu_region_idx_t region_idx)
{
  ASSERT_DBG_PARAM(IS_MPU_REGION(region_idx));

  STM32_WRITE_REG(MPU->RNR, (uint32_t)region_idx);

  return ((STM32_READ_BIT(MPU->RLAR, MPU_RLAR_EN_Msk) == MPU_RLAR_EN_Msk)
          ? HAL_CORTEX_MPU_REGION_ENABLED : HAL_CORTEX_MPU_REGION_DISABLED);
}


/**
  * @}
  */

/** @addtogroup CORTEX_Exported_Functions_Group4
  *  @{
- This subsection provides a set of functions to configure CORTEX SCB block features.
  - Use HAL_CORTEX_SCB_GetInfo() to get the CPU ID information.
  - Use HAL_CORTEX_SCB_DisableHardFaultEscalation() to disable an exception fault escalation.
  - Use HAL_CORTEX_SCB_EnableHardFaultEscalation() to enable an exception fault escalation.
 */

/**
  * @brief Get CPU ID information.
  * @param p_info: Pointer to the \ref hal_cortex_scb_cpuid_info_t structure.
  */
void HAL_CORTEX_SCB_GetInfo(hal_cortex_scb_cpuid_info_t *p_info)
{
  ASSERT_DBG_PARAM(p_info != NULL);

  p_info->revision     = _FLD2VAL(SCB_CPUID_REVISION, SCB->CPUID);
  p_info->part_number  = _FLD2VAL(SCB_CPUID_PARTNO, SCB->CPUID);
  p_info->architecture = _FLD2VAL(SCB_CPUID_ARCHITECTURE, SCB->CPUID);
  p_info->variant      = _FLD2VAL(SCB_CPUID_VARIANT, SCB->CPUID);
  p_info->implementer  = _FLD2VAL(SCB_CPUID_IMPLEMENTER, SCB->CPUID);
}

/**
  * @brief Enable a fault escalation to HardFault.
  * @param faults This parameter can be a combination of the following values:
  *        @arg @ref HAL_CORTEX_SCB_USAGE_FAULT           Usage fault
  *        @arg @ref HAL_CORTEX_SCB_BUS_FAULT             Bus fault
  *        @arg @ref HAL_CORTEX_SCB_MEM_MANAGEMENT_FAULT  Memory management fault
  */
void HAL_CORTEX_SCB_EnableHardFaultEscalation(uint32_t faults)
{
  ASSERT_DBG_PARAM(IS_FAULT_EXCEPT(faults));

  SCB_DisableFault(faults);
}

/**
  * @brief Disable a fault escalation to HardFault.
  * @param faults This parameter can be a combination of the following values:
  *        @arg @ref HAL_CORTEX_SCB_USAGE_FAULT           Usage fault
  *        @arg @ref HAL_CORTEX_SCB_BUS_FAULT             Bus fault
  *        @arg @ref HAL_CORTEX_SCB_MEM_MANAGEMENT_FAULT  Memory management fault
  */
void HAL_CORTEX_SCB_DisableHardFaultEscalation(uint32_t faults)
{
  ASSERT_DBG_PARAM(IS_FAULT_EXCEPT(faults));

  SCB_EnableFault(faults);
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
#endif /* USE_HAL_CORTEX_MODULE */
/**
  * @}
  */
